Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisTypeEnum Enumeration
 The analysis types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisTypeEnum
Public Enumeration AnalysisTypeEnum
Members
Member name | Value | Description
ANALYSIS_TYPE_IGNORE | 1 |  The ignore analysis type.
ANALYSIS_TYPE_TRUSS | 2 |  The truss analysis type.
ANALYSIS_TYPE_RIGID_DIAPHRAGM | 3 |  The rigid diaphragm analysis type.
ANALYSIS_TYPE_TENSION_ONLY | 4 |  The tension only analysis type.
ANALYSIS_TYPE_COMPRESSION_ONLY | 5 |  The compression only analysis type.
ANALYSIS_TYPE_SHELL | 6 |  The shell analysis type.
ANALYSIS_TYPE_SHEAR_WALL | 7 |  The wall analysis type.
ANALYSIS_TYPE_BEAM | 8 |  The beam analysis type.
ANALYSIS_TYPE_MEMBRANE | 9 |  The membrane analysis type.
ANALYSIS_TYPE_PLATE | 10 |  The plate analysis type.
ANALYSIS_TYPE_MAT_FOUNDATION | 11 |  The mat foundation analysis type.
See Also
Reference
Tekla.Structures.Analysis Namespace